> for-in
```
for (property in expression) statement;
```
> label
```
label: statement
```

> with:将代码的作用域设置到一个特定对象中,严格模式下不允许使用with
```
with (expression) statement
```

> switch
```
switch (expression) {
    case value: statement
        break;
    case value: statement
        break;
    case value: statement
        break;
    default: statement
}
```